tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

tap 'mongodb/brew'
tap 'universal-ctags/universal-ctags'

brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bitwarden-cli'
brew 'coreutils'
brew 'direnv'
brew 'docker-compose', link: true
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'gibo'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'haskell-stack'
brew 'htop'
brew 'httpie'
brew 'ifstat'
brew 'jq'
brew 'mongodb-community'
brew 'mongodb-database-tools'
brew 'mysql'
brew 'n'
brew 'neofetch'
brew 'neovim'
brew 'plantuml'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'shellcheck'
brew 'spark'
brew 'starship'
brew 'tealdeer'
brew 'tfenv'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: ['head']
brew 'wifi-password'
brew 'z'

cask 'bitwarden'
cask 'brave-browser'
cask 'docker'
cask 'dozer'
cask 'font-sauce-code-pro-nerd-font'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'kitty'
cask 'miniconda'
cask 'ngrok'
cask 'scroll-reverser'
cask 'slack'
cask 'viscosity'

BREWFILE_LOCAL = File.join(ENV['HOME'], '.local/brew', 'Brewfile')
if File.file?(BREWFILE_LOCAL)
  instance_eval(File.read(BREWFILE_LOCAL))
end
