tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'universal-ctags/universal-ctags'

brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'direnv'
brew 'docker-compose'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'haskell-stack'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'lf'
brew 'n'
brew 'neofetch'
brew 'neovim'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'shellcheck'
brew 'spark'
brew 'tealdeer'
brew 'tfenv'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tree'
brew 'universal-ctags', args: ['head']
brew 'wifi-password'

# Mac OS only
if RUBY_PLATFORM.include? 'darwin'
    brew 'reattach-to-user-namespace'
end

cask 'docker'
cask 'dozer'
cask 'font-sourcecodepro-nerd-font-mono'
cask 'google-chrome'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'kitty'
cask 'miniconda'
cask 'ngrok'
cask 'scroll-reverser'
cask 'slack'
cask 'viscosity'

BREWFILE_LOCAL = File.join(ENV['HOME'], '.local', 'Brewfile')
if File.file?(BREWFILE_LOCAL)
  instance_eval(File.read(BREWFILE_LOCAL))
end
